{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Computer Science and Economics",
      "duration": "2013-2021",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NickLesho",
  "highlighted_projects": [
    {
      "description": "Developed a mind-controlled keyboard's user interface and front-end functionality using HTML, CSS, JavaScript, and React. A Muse headset was used to gather EEG signals from a user and an algorithm to select characters on the keyboard that involved flashing rows and columns was implemented in JavaScript. When either the row or the column that contained the character that the user wanted to select flashed on the screen, a specific brain signal was detected. When both the row and the column were selected at least once, the character was typed on the screen. Users could switch between alphanumerical and emoji keyboards, for which separate React components were made. The Electron framework was used to build the project, which allows for the development of desktop GUI applications using web technologies. Worked in an Agile environment and used GitHub to collaborate on the project and Slack to communicate.",
      "name": "MindType mind-controlled keyboard"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a program that provides information on hardware specifications and real-time resource usage (such as CPU and memory) for each node within a system of nodes/servers connected through a network switch using Bash scripts, PostgreSQL and Docker. The information is stored and retrieved from a PostgreSQL database which is provisioned using Docker. A Bash agent consisting of two Bash scripts is used to gather server usage data and insert it into the database. Automated the bash agent using crontab. All of the source code is available on the project's GitHub repository.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Developed an application that allows a user to perform CRUD (Create, Read, Update, Delete) operations on a table that resides within a PostreSQL database using Java's JDBC API. The PostgreSQL database is containerized using Docker. The project was built in Java using the IntelliJ IDE, relies on the Maven project management tool, and uses the Data Access Object (DAO) design pattern. All of the source code is available on the project's GitHub repository.",
        "Grep App: Developed a Java grep application that allows a user to search for a text pattern recursively in a given directory, and output matched lines to a file. This application mimics the Linux grep command by having the user input a root directory, regex pattern, and output file location, and writing each line that contains the pattern to the output file. The project was built in Java using the IntelliJ IDE and relies on the Maven project management tool. The project uses Lists, regex, lf4j, slf4j, log4j, java.op, java.nio.file, lambda, and stream. A docker image that was created for the project is available on Docker Hub, and all of the source code is available on the project's GitHub repository."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Nick Lesho",
  "others": [
    {
      "bullets": [
        "Webmaster for U of T Women in Computer Science, September 2019 - April 2021",
        "Front End Web Developer at NeurotechUofT, February 2018 - April 2019",
        "Marketing Director at Pencils of Promise, U of T Chapter, January 2019 - April 2020",
        "Marketing Director at water.org, U of T Chapter, September 2018 - April 2020"
      ],
      "title": "Extracurricular Experience"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed applications using the latest technologies, including Java, RDBMS/SQL, Linux/Bash, Docker and Git. Worked in an Agile/Scrum environment, participating in daily stand-up meetings and collaborating with other team members, senior developers and scrum masters to facilitate progress, and to provide and receive feedback. Assumed role of team lead during one of the Scrum sprints. Used GitHub to collaborate on applications and used Slack and Zoom for communication.",
      "duration": "December 2021 - present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "TypeScript",
      "REST API",
      "Bootstrap",
      "Chrome Developer Tools",
      "Wix"
    ],
    "familiar": [
      "Angular.js",
      "Vue.js",
      "Spring Boot",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "proficient": [
      "Java",
      "Python/Django",
      "JavaScript/React",
      "RDBMS/SQL",
      "Linux/Bash",
      "Agile / Scrum",
      "Git",
      "HTML/CSS"
    ]
  },
  "summary": "I graduated with a Computer Science and Economics degree from the University of Toronto in June of 2021. Upon graduating, I worked as part of a 3-month contract for Canadian Musicians Co-operative as a Computer Systems Analyst. My duties included web development, IT support, and debugging an Android application. Currently, I am a technical consultant at Jarvis. I am passionate about web development, with proficiency in both front-end and back-end web development. I am especially passionate about using technical skills to solve problems for a wide variety of stakeholders. With the tech industry constantly changing and evolving, I am excited about learning and using all the new technologies that will unfold."
}
