{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Computer Science and Economics",
      "duration": "2013-2021",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NickLesho",
  "highlighted_projects": [
    {
      "description": "Developed the user interface and front-end functionality of a mind-controlled keyboard using HTML, CSS, JavaScript, and React. Worked in an Agile environment and used GitHub to collaborate on the project and Slack to communicate.",
      "name": "MindType mind-controlled keyboard"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a program that provides information on hardware specifications, and real-time resource usage (such as CPU and memory) for each node within a system of nodes/servers connected through a network switch. The information is stored and retrieved from an RDBMS. Docker is used to provision the database and a psql instance is used to store all the data. A bash agent is used to gather server usage data and insert it into the database. The bash agent is composed of two bash scripts. The host_info.sh bash script inserts the host hardware info into the database and is run once. The host_usage.sh bash script collects the current host usage and inserts it into the database. It is run every minute using crontab. All of the source code is available on the project's GitHub repository.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Nick Lesho",
  "others": [
    {
      "bullets": [
        "Webmaster for U of T Women in Computer Science, September 2019 - April, 2021",
        "Front End Web Developer at NeurotechUofT, February 2018 - April 2019"
      ],
      "title": "Extracurricular Experience"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented a solution for recording and retrieving hardware specification and resource usage using an RDBMS and bash scripts. Regularly attended daily scrum meeting to discuss progress with team members.",
      "duration": "December 2021 - present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "React",
      "Bootstrap",
      "TypeScript",
      "Django",
      "REST API",
      "Chrome Developer Tools",
      "Wix"
    ],
    "familiar": [
      "Angular.js",
      "Vue.js",
      "Spring Boot",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "proficient": [
      "HTML",
      "CSS",
      "JavaScript",
      "Python",
      "Java",
      "Linux/Bash",
      "RDBMS / SQL",
      "Agile / Scrum",
      "Git"
    ]
  },
  "summary": "I graduated with a Computer Science and Economics degree from the University of Toronto in June of 2021. Upon graduating, I worked as part of a 3-month contract for Canadian Musicians Co-operative as a Computer Systems Analyst. My duties included web development, IT support, and debugging an Android application. Currently, I am a technical consultant at Jarvis. I am passionate about web development, with proficiency in both front-end and back-end web development. I am especially passionate about using technical skills to solve problems for a wide variety of stakeholders. With the tech industry constantly changing and evolving, I am excited about learning and using all the new technologies that will unfold."
}
